[
  {
    "問題ID": 1,
    "問題文": "システム開発の進捗管理やソフトウェアの品質管理などで用いられるPDCAサイクルの\"P\"，\"D\"，\"C\"，\"A\"は，それぞれ英単語の頭文字をとったものである。3番目の文字\"C\"が表す単語はどれか。",
    "解答": "Check",
    "解説": "Plan(計画)\n目標を決め、実現するための計画を策定する\nDo(実行)\n計画を業務に適用する\nCheck(点検・評価)\n計画通りに業務が行われているか確認する\nAct(処置・改善)\n必要に応じて計画に修正を加える",
    "ア": "Challenge",
    "イ": "Change",
    "ウ": "Check",
    "エ": "Control"
  },
  {
    "問題ID": 2,
    "問題文": "プロジェクトの特性はどれか。",
    "解答": "独自性も有期性もある。",
    "解説": "特定の目的や(大きな)目標を達成するために実行される定常業務ではない一度限りの活動や計画をいいます。またPMBOKの定義では「プロジェクトとは、独自の製品、サービス、所産を創造するために実施される有期性の業務である。」とされています。",
    "ア": "独自性はあるが，有期性がない。",
    "イ": "独自性はないが，有期性がある。",
    "ウ": "独自性も有期性もある。",
    "エ": "独自性も有期性もない。"
  },
  {
    "問題ID": 3,
    "問題文": "プロジェクトマネジメントのプロセスのうち，計画プロセスグループ内で実施するプロセスはどれか。",
    "解答": "スコープの定義",
    "解説": "立ち上げ\nプロジェクトを開始する必要性の明確化、および組織としてプロジェクトに着手することの宣言を行う\n計画\n要求を満足するための、実行可能な作業の仕組みを確立、およびその仕組みを維持する\n実行\n人及びその他資源を活用し、計画を実行する\n監視・コントロール\n進捗の監視・測定、および予定-実績の相違の検出し是正措置を実行する\n終結\nプロジェクトの結果の文書化、および顧客による検収の確認、プロジェクトの完了手続きを行う",
    "ア": "スコープの定義",
    "イ": "ステークホルダの特定",
    "ウ": "品質保証の実施",
    "エ": "憲章の作成"
  },
  {
    "問題ID": 4,
    "問題文": "プロジェクトに関わるステークホルダの説明のうち，適切なものはどれか。",
    "解答": "プロジェクトの成果が，自らの利益になる者と不利益になる者がいる。",
    "解説": "ステークホルダ(Stakeholder)は、日本語では利害関係者といい、プロジェクトメンバ、プロジェクトマネージャ、顧客、株主、経営者、地域などのように、プロジェクト活動によって利害が生じる可能性のある全ての者です。そのプロジェクトに直接的にかかわる者だけではなく、間接的に影響を受ける可能性のある者も含まれます。また、そのプロジェクトが利益になる者、損害になる者の両方が含まれます。",
    "ア": "組織の内部に属しており，組織の外部にいることはない。",
    "イ": "プロジェクトに直接参加し，間接的な関与にとどまることはない。",
    "ウ": "プロジェクトの成果が，自らの利益になる者と不利益になる者がいる。",
    "エ": "プロジェクトマネージャのように，個人として特定できることが必要である。"
  },
  {
    "問題ID": 5,
    "問題文": "ソフトウェア開発プロジェクトにおいてWBS(Work Breakdown Structure)を使用する目的として，適切なものはどれか。",
    "解答": "作業を階層的に詳細化して，管理可能な大きさに細分化する。",
    "解説": "WBS(Work Breakdown Structure)は、プロジェクト目標を達成し、必要な成果物を過不足なく作成するために、プロジェクトチームが実行すべき作業を、成果物を主体に階層的に要素分解したものです。作業の漏れや抜けを防ぎ、プロジェクトの範囲を明確にすると同時に、作業単位ごとに内容・日程・目標を設定することでコントロールをしやすくする目的があります。",
    "ア": "開発の期間と費用がトレードオフの関係にある場合に，総費用の最適化を図る。",
    "イ": "作業の順序関係を明確にして，重点管理すべきクリティカルパスを把握する。",
    "ウ": "作業の日程を横棒(バー)で表して，作業の開始や終了時点，現時点の進捗を明確にする。",
    "エ": "作業を階層的に詳細化して，管理可能な大きさに細分化する。"
  },
  {
    "問題ID": 6,
    "問題文": "二つのアクティビティが次の関係にあるとき，論理的な依存関係はどれか。\n\n\"システム要件定義プロセス\"が完了すれば，\"システム方式設計プロセス\"が開始できる。",
    "解答": "FS関係(Finish-to-Start)",
    "解説": "「\"システム要件定義プロセス\"が完了すれば，\"システム方式設計プロセス\"が開始できる。」の事例は、システム要件定義プロセスの終了が、システム方式設計プロセスの開始条件となっているため「FS関係(Finish-to-Start)」に該当します。",
    "ア": "FF関係(Finish-to-Finish)",
    "イ": "FS関係(Finish-to-Start)",
    "ウ": "SF関係(Start-to-Finish)",
    "エ": "SS関係(Start-to-Start)"
  },
  {
    "問題ID": 7,
    "問題文": "プロジェクトのスケジュールを短縮するために，アクティビティに割り当てる資源を増やして，アクティビティの所要期間を短縮する技法はどれか。",
    "解答": "クラッシング",
    "解説": "プロジェクトの所要時間を短縮する方法は「クラッシング」と「ファストトラッキング」に大別されます。\nクラッシング\nメンバの時間外勤務を増やしたり、業務内容に精通したメンバを新たに増員するなど、クリティカルパス上のアクティビティに資源を追加投入して短縮を図る。\nファストトラッキング\n全体の設計が完了する前に、仕様が固まっているモジュールの開発を開始するなど、当初の計画では順番に行う予定だったアクティビティを並行して行うことによって短縮を図る。",
    "ア": "クラッシング",
    "イ": "クリティカルチェーン法",
    "ウ": "ファストトラッキング",
    "エ": "モンテカルロ法"
  },
  {
    "問題ID": 8,
    "問題文": "テストの進捗管理に使用する指標として，最も適切なものはどれか。",
    "解答": "テスト項目の消化件数",
    "解説": "ソフトウェアテストは、用意したテストをすべて消化することで、システムやモジュールに含まれる潜在的な欠陥を発見し、ソフトウェアとしての完成度を検証する工程です。",
    "ア": "テスト項目の消化件数",
    "イ": "テストデータの作成量",
    "ウ": "プログラムの起動回数",
    "エ": "プログラムの修正量"
  },
  {
    "問題ID": 9,
    "問題文": "システム開発プロジェクトの実施計画を作成し，クリティカルパスを求めた。クリティカルパスによって把握できる作業はどれか。",
    "解答": "作業の遅れがプロジェクト全体の遅れに直結する作業",
    "解説": "クリティカルパスとは、プロジェクトのスケジュールにおいて、遅延することがプロジェクト全体の遅延につながってしまう一連の作業のつながりを示す経路のことをいいます。\nクリティカルパス上の作業は遅れが生じるとプロジェクト計画全体に遅れが生じ、所要日数を改善できればプロジェクト全体の所要日数を改善できるため、重点的に管理する必要があります。",
    "ア": "作業の遅れがプロジェクト全体の遅れに直結する作業",
    "イ": "システムの品質を確保する上で，最も注意すべき作業",
    "ウ": "実施順序の変更が可能な作業",
    "エ": "最も費用のかかる作業"
  },
  {
    "問題ID": 10,
    "問題文": "進捗管理に用いられるガントチャートの特徴として，適切なものはどれか。",
    "解答": "日程について予定と実績を対比することができる。",
    "解説": "ガントチャート(Gantt chart)は、縦軸に作業項目・横軸に時間をとり、作業に必要な期間を横棒の長さで表記する図法です。作業項目同士の日程的な重なりがわかりやすいため日程計画の策定に使用されたり、計画と実績を並べて表記することで進捗度を管理する方法としても用いられます。",
    "ア": "作業遅れによるほかの作業への影響を明確にすることができる。",
    "イ": "作業の順序関係を明示することができる。",
    "ウ": "進捗管理上のポイントであるクリティカルパスを明確にすることができる。",
    "エ": "日程について予定と実績を対比することができる。"
  },
  {
    "問題ID": 11,
    "問題文": "ソフトウェア開発の見積方法の一つであるファンクションポイント法の説明として，適切なものはどれか。",
    "解答": "ソフトウェアの機能を入出力データ数やファイル数などによって定量的に計測し，複雑さによる調整を行って，ソフトウェア規模を見積もる方法である。",
    "解説": "ファンクションポイント法は、外部入出力や内部ファイルの数と難易度の高さから、ファンクションポイントという数値を算出し、それを元に論理的に開発規模を見積もる手法です。画面や帳票の数などを基準に見積もるので、依頼者からのコンセンサス(合意)が得られやすいという長所があります。",
    "ア": "開発規模が分かっていることを前提として，工数と工期を見積もる方法である。ビジネス分野に限らず，全分野に適用可能である。",
    "イ": "過去に経験した類似のソフトウェアについてのデータを基にして，ソフトウェアの相違点を調べ，同じ部分については過去のデータを使い，異なった部分は経験に基づいて，規模と工数を見積もる方法である。",
    "ウ": "ソフトウェアの機能を入出力データ数やファイル数などによって定量的に計測し，複雑さによる調整を行って，ソフトウェア規模を見積もる方法である。",
    "エ": "単位作業項目に適用する作業量の基準値を決めておき，作業項目を単位作業項目まで分解し，基準値を適用して算出した作業量の積算で全体の作業量を見積もる方法である。"
  },
  {
    "問題ID": 12,
    "問題文": "PMBOKによれば，プロジェクトのリスクマネジメントにおいて，脅威に対して適用できる対応戦略と好機に対して適用できる対応戦略がある。脅威に対して適用できる対応戦略はどれか。",
    "解答": "受容",
    "解説": "PMBOKによればプロジェクトにマイナスの影響を与えるリスク(脅威)への対応戦略には「回避」「転嫁」「軽減」「受容」の4種類があります。\n受容\nリスクが現実化した時の影響が許容可能範囲内である場合やリスクの除去が困難であるときに、特に対策をせずにそのままにしておく戦略。対策費用が予想される損失金額を上回っているときなどに採られる。",
    "ア": "活用",
    "イ": "強化",
    "ウ": "共有",
    "エ": "受容"
  },
  {
    "問題ID": 13,
    "問題文": "ウォータフォール型のソフトウェア開発において，運用テストで発見された誤りの修復に要するコストに関する記述のうち，適切なものはどれか。",
    "解答": "外部設計の誤りは，プログラムだけでなく，マニュアルなどにも影響を与えるので，コーディングの誤りに比べて修復コストは高い。",
    "解説": "大規模なプロジェクトにおいて進捗を管理しやすいというメリットがありますが、ウォータフォールモデルは基本的に工程の後戻りを想定していない開発モデルであるため、上流工程での誤りを発見する手順が組み込まれていないこともあります。このような事情から上流工程での誤りは、下流工程にいくにつれて大きなものになっていってしまいます。\nつまりウォータフォールモデルでは、上流工程での誤りであればあるほど、下流工程への影響も大きく修復コストが高くなる傾向にあると言えます。",
    "ア": "外部設計の誤りは，プログラムだけでなく，マニュアルなどにも影響を与えるので，コーディングの誤りに比べて修復コストは高い。",
    "イ": "コーディングの誤りは，修復のための作業範囲がその後の全工程に及ぶので，要求定義の誤りに比べて修復コストは高い。",
    "ウ": "テストケースの誤りは，テストケースの修正とテストのやり直しだけでは済まないので，外部設計の誤りに比べて修復コストは高い。",
    "エ": "内部設計の誤りは，設計レビューによってほとんど除去できるので，もし発見されでも，コーディングの誤りに比べて修復コストは安い。"
  },
  {
    "問題ID": 14,
    "問題文": "リスク識別に使用する技法の一つであるデルファイ法の説明はどれか。",
    "解答": "複数の専門家から得られた匿名の見解を要約して，再配布することを何度か繰り返して収束される。",
    "解説": "デルファイ法は次の手順に従って行われます。\n1.複数の専門家を回答者として選定する。\n2.質問に対する回答結果をフィードバックし，再度質問を行う。\n3.回答結果を統計的に処理し，確率分布とともに回答結果を示す。",
    "ア": "確率分布を使用したシミュレーションを行う。",
    "イ": "過去の情報や知識を基にして，あらかじめ想定されるリスクをチェックリストにまとめておき，チェックリストと照らし合わせることでリスクを識別する。",
    "ウ": "何人かが集まって，他人のアイディアを批判することなく，自由に多くのアイディアを出し合う。",
    "エ": "複数の専門家から得られた匿名の見解を要約して，再配布することを何度か繰り返して収束される。"
  },
  {
    "問題ID": 15,
    "問題文": "リスクが顕在化しても，その影響が小さいと想定されるので，損害の負担を受容するリスク対応はどれか。",
    "解答": "リスク保有",
    "解説": "リスク保有\nリスクに対して何も行わない戦略。損失額と発生確率が共に低い軽微なリスク、又は対策コストが被害時の損失コストを上回るようなリスクに適用される。\n設問の「損害の負担を受容する」という記述からリスク保有と分かります。",
    "ア": "リスク移転",
    "イ": "リスク回避",
    "ウ": "リスク低減",
    "エ": "リスク保有"
  },
  {
    "問題ID": 16,
    "問題文": "リスク分析に関する記述のうち，適切なものはどれか。",
    "解答": "考えられるすべてのリスクに対処することは，時間と費用がかかりすぎるので，損失額と発生確率を予測し，リスクの大きさに従って優先順位を付けるべきである。",
    "解説": "リスク分析では、洗い出されたリスクが顕在化する可能性と、損害を受ける情報資産の重要度などから各リスクの大きさ（危険度）を評価します。\n危険度の高いリスクには積極的に経営資源を投入し、危険度の低いリスクにはあまり経営資源を投入しないなど、メリハリのある対策を行うことで効率的なリスク管理を行うことができます。",
    "ア": "考えられるすべてのリスクに対処することは，時間と費用がかかりすぎるので，損失額と発生確率を予測し，リスクの大きさに従って優先順位を付けるべきである。",
    "イ": "リスク分析によって評価されたリスクに対し，すべての対策が完了しないうちに，繰り返しリスク分析を実施することは避けるべきである。",
    "ウ": "リスク分析は，将来の損失を防ぐことが目的であるから，過去の類似プロジェクトで蓄積されたデータを参照することは避けるべきである。",
    "エ": "リスク分析は，リスクの発生による損失額を知ることが目的であり，その損失額に応じて対策の費用を決定すべきである。"
  },
  {
    "問題ID": 17,
    "問題文": "プロジェクトで発生した課題の傾向を分析するために，ステークホルダ，コスト，スケジュール，品質などの管理項目別の課題件数を棒グラフとして件数が多い順に並べ，この順で累積した課題件数を折れ線グラフとして重ね合わせた図を作成した。この図はどれか。",
    "解答": "特性要因図",
    "解説": "項目を大きい順に並べた棒グラフと、累積構成比を表す折れ線グラフの組合せとくればパレート図です。パレート図は、値の大きい順に分析対象の項目を並べた棒グラフと、累積構成比を表す折れ線グラフを組み合わせた複合グラフで、主に複数の分析対象の中から管理対象とすべき重要な要素を識別するために使用されます。",
    "ア": "管理図",
    "イ": "散布図",
    "ウ": "特性要因図",
    "エ": "パレート図"
  },
  {
    "問題ID": 18,
    "問題文": "ソフトウェアの品質特性の定義において，あるコンピュータ用に作成したプログラムを別のアーキテクチャのコンピュータで動作できるようにすることの容易さを表す特性はどれか。",
    "解答": "移植性(Portability)",
    "解説": "移植性\n移植のしやすさ\n別の環境へ移した際そのまま動作する度合い\nしたがってこの問題の「あるコンピュータ用に作成したプログラムを別のアーキテクチャのコンピュータで動作できるようにすることの容易さを表す特性」は、移植性になります。",
    "ア": "移植性(Portability)",
    "イ": "使用性(Usability)",
    "ウ": "相互運用性(Interoperability)",
    "エ": "変更性(Changeability)"
  },
  {
    "問題ID": 19,
    "問題文": "プロジェクトメンバが16人のとき，2人ずつの総当たりでプロジェクトメンバ相互の顔合わせ会を行うためには，延べ何時間の顔合わせ会が必要か。ここで，顔合わせ会1回の所要時間は0.5時間とする。",
    "解答": 60,
    "解説": "16人をそれぞれA、B、…、Pとすると、\nAとB、AとC、…、AとP(15通り)\nBとC、BとD、…、BとP(14通り)\nCとD、CとE、…、CとP(13通り)\n(省略)\nNとO、NとP(2通り)\nOとP(1通り)\nとなるため、\n\n　15＋14＋13＋…＋2＋1＝120組\n　120組×0.5時間＝60時間",
    "ア": 8,
    "イ": 16,
    "ウ": 30,
    "エ": 60
  },
  {
    "問題ID": 20,
    "問題文": "ある商品のメーカ別の市場構成比を表すのに適切なグラフはどれか。",
    "解答": "帯グラフ",
    "解説": "帯グラフは、帯状の長方形をある長さで区切り、その各部分の面積で数量の大きさを表します。全体に対しての割合の大小を見るのに便利なグラフです。",
    "ア": "Zグラフ",
    "イ": "帯グラフ",
    "ウ": "折れ線グラフ",
    "エ": "レーダチャート"
  }
]