[
  {
    "問題ID": 1,
    "問題文": "損益分岐点の特性を説明したものはどれか。",
    "解答": "損益分岐点での売上高は，固定費と変動費の和に等しい。",
    "解説": "損益分岐点の公式に当てはめると損益分岐点＝固定費÷(1－変動費率)になりこの公式を見ると、固定費または変動費率が小さいほど、損益分岐点は低くなる関係にあることがわかります。",
    "ア": "固定費が変わらないとき，変動費率が低くなると損益分岐点は高くなる",
    "イ": "固定費が変わらないとき，変動費率の変化と損益分岐点の変化は正比例する。",
    "ウ": "損益分岐点での売上高は，固定費と変動費の和に等しい。",
    "エ": "変動費率が変わらないとき，固定費が小さくなると損益分岐点は高くなる。"
  },
  {
    "問題ID": 2,
    "問題文": "バランススコアカードの内部ビジネスプロセスの視点における戦略目標と業績評価指標の例はどれか。",
    "解答": "製品の製造の生産性向上が目標であるので，製造期間短縮日数を指標とする。",
    "解説": "バランススコアカード(Balanced Score Card、BSC)は、企業のビジョンと戦略を実現するために、「財務」「顧客」「内部ビジネスプロセス」「学習と成長」という4つの視点から業績を評価・分析する手法です。内部ビジネスプロセスの視点では、原価率、不良率、生産性、リードタイム、サイクルタイムなど、組織の業務がどれだけ改善されたかを定量的に検証できる評価指標を設定します。",
    "ア": "持続的成長が目標であるので，受注残を指標とする。",
    "イ": "主要顧客との継続的な関係構築が目標であるので，クレーム件数を指標とする。",
    "ウ": "製品開発力の向上が目標であるので，製品開発領域の研修受講時間を指標とする。",
    "エ": "製品の製造の生産性向上が目標であるので，製造期間短縮日数を指標とする。"
  },
  {
    "問題ID": 3,
    "問題文": "BI(Business Intelligence)の活用事例として，適切なものはどれか。",
    "解答": "業績の評価や経営戦略の策定を行うために，業務システムなどに蓄積された膨大なデータを分析する。",
    "解説": "データウェアハウスやデータマートに集積された情報を、BIツールが備えるOLAP(Online Analytical Processing)やデータマイニングの機能を用いて分析することで迅速な意思決定を支援します。",
    "ア": "競合する他社が発行するアニュアルレポートなどの刊行物を入手し，経営戦略や財務状況を把握する。",
    "イ": "業績の評価や経営戦略の策定を行うために，業務システムなどに蓄積された膨大なデータを分析する。",
    "ウ": "電子化された学習教材を社員がネットワーク経由で利用することを可能にし，学習・成績管理を行う。",
    "エ": "りん議や決裁など，日常の定型的業務を電子化することによって，手続を確実に行い，処理を迅速にする。"
  },
  {
    "問題ID": 4,
    "問題文": "コンビニエンスストアにおいて，ポイントカードなどの個人情報と結び付けられた顧客ID付きPOSデータを収集・分析することによって確認できるものはどれか。",
    "解答": "同一商品の購入頻度",
    "解説": "POSシステムでは、販売時にバーコード等をスキャンすることで、商品、価格、販売日時・時刻、店舗等を記録します。これにより、いつ、どこで、何が、どれだけ売れたかを正確に把握できます。これらの情報に、顧客ID等の顧客を識別する情報が加わることで、顧客1人ごとの購買行動を分析することが可能となります。",
    "ア": "商品の最終的な使用者",
    "イ": "商品の店舗までの流通経路",
    "ウ": "商品を購入する動機",
    "エ": "同一商品の購入頻度"
  },
  {
    "問題ID": 5,
    "問題文": "標準原価計算の説明として，適切なものはどれか。",
    "解答": "製品1単位当たりの達成すべき原価を設定し，それを基準に計算した結果と実際原価との原価差異を分析する。",
    "解説": "標準原価と実際に掛かった原価を比較することで、その原因を分析(差異を把握)し原価管理を効率的に行うことができる",
    "ア": "原価要素を変動費と固定費に分類し，変動費を製品原価として計算し，固定費は発生した期間の費用 (期間原価) として計算する。",
    "イ": "新製品の企画・開発段階において，目標販売価格から目標利益を差し引いた許容原価を基に目標原価を設定する。",
    "ウ": "製品1単位当たりの達成すべき原価を設定し，それを基準に計算した結果と実際原価との原価差異を分析する。",
    "エ": "発生した原価を，活動単位に集計して活動コストを求め，それを製品やサービスに割り当てる。"
  },
  {
    "問題ID": 6,
    "問題文": "デビットカードの決済方式はどれか。",
    "解答": "利用金額を預金口座から即時に引き落とす。",
    "解説": "通常のクレジットカードと違い申し込み時の審査が無いため、クレジットカードの取得困難な人でも、口座開設と共に発行されることがメリットとしてあげられますが、取引時に口座の暗証番号の入力が必要なことによるセキュリティ面での心配もあります。",
    "ア": "後払い方式の決済を行う。",
    "イ": "カード内で残高管理を行い，財布のように利用できる。",
    "ウ": "前払い方式の決済を行う。",
    "エ": "利用金額を預金口座から即時に引き落とす。"
  },
  {
    "問題ID": 7,
    "問題文": "シュリンクラップ契約において，ソフトウェアの使用許諾契約が成立するのはどの時点か。",
    "解答": "ソフトウェアの入ったDVD-ROMの包装を解いた時点",
    "解説": "パッケージの表面に使用許諾契約が印刷され、透明フィルムで包装された市販のパッケージソフトなどに適用されるケースがあります。",
    "ア": "購入したソフトウェアの代金を支払った時点",
    "イ": "ソフトウェアの入ったDVD-ROMを受け取った時点",
    "ウ": "ソフトウェアの入ったDVD-ROMの包装を解いた時点",
    "エ": "ソフトウェアをPCにインストールした時点"
  },
  {
    "問題ID": 8,
    "問題文": "データウェアハウスを稼働させたが，一向に利用されない。ヒアリングの結果，利用者のスキルレベルが予想より低いという結論に達した。利用促進のための改善策として，適切なものはどれか。",
    "解答": "データ抽出や分析パターンに応じたテンプレートを標準として用意する。",
    "解説": "テンプレートを用意することで、特別なスキルがなくてもデータウェアハウスを活用できるようになります。利用者のスキルレベルが予想より低いという現状に合わせた適切な施策です。",
    "ア": "管理職を通じて利用を促進するように通知を出す。",
    "イ": "データ抽出や分析パターンに応じたテンプレートを標準として用意する。",
    "ウ": "データをよりリアルタイムに提供し，データの精度を向上させる。",
    "エ": "利用者から要求されていると思われる情報を更に追加する。"
  },
  {
    "問題ID": 9,
    "問題文": "システム化計画を立案するときに考慮すべき事項はどれか。",
    "解答": "開発，保守，運用に関する費用と投資効果を明確にする",
    "解説": "システム化計画の立案で実施されるタスクに「システム実現時の定量的，定性的効果予測を行う。また，開発，運用，保守に関する期間，体制，工数の大枠を予測し，システム実現のための費用を見積もる。",
    "ア": "運用を考えて，自社の社員が開発する前提で検討を進める。",
    "イ": "開発，保守，運用に関する費用と投資効果を明確にする。",
    "ウ": "失敗を避けるため，同業他社を調査し，同じシステムにする。",
    "エ": "テスト計画，運用マニュアル及び障害対策を具体的に示す。"
  },
  {
    "問題ID": 10,
    "問題文": "観測データを類似性によって集団や群に分類し，その特徴となる要因を分析する手法はどれか。",
    "解答": "クラスタ分析法",
    "解説": "複数の異なる性質のものが混ざり合っている対象の中から、類似したものを集めてグループを作り、対象を分類するために用いられます。",
    "ア": "クラスタ分析法",
    "イ": "指数平滑法",
    "ウ": "デルファイ法",
    "エ": "モンテカルロ法"
  },
  {
    "問題ID": 11,
    "問題文": "ソフトウェアライフサイクルを，企画，要件定義，開発，運用，保守のプロセスに区分したとき，企画プロセスの目的はどれか。",
    "解答": "事業の目的，目標を達成するために必要なシステムに関係する要求事項の集合とシステム化の方針，及びシステムを実現するための実施計画を得ること",
    "解説": "共通フレーム2007によれば、企画プロセスの目的は「経営事業の目的，目標を達成するために必要なシステムに関係する要求事項の集合とシステム化の方針，及び，システムを実現するための実施計画を得ることである」とされています。",
    "ア": "新しい業務のあり方や運用をまとめた上で，業務上実現すべき要件を明らかにすること",
    "イ": "事業の目的，目標を達成するために必要なシステムに関係する要求事項の集合とシステム化の方針，及びシステムを実現するための実施計画を得ること",
    "ウ": "システムに関する要件について技術的に可能であるかどうかを検証し，システム設計が可能な技術要件に変換すること",
    "エ": "システムの仕様を明確化し，それを基にIT化範囲とその機能を具体的に明示すること"
  },
  {
    "問題ID": 12,
    "問題文": "著作権法に照らして適法な行為はどれか。",
    "解答": "経済白書の記載内容を説明の材料として，出所を明示してWebページに転載する。",
    "解説": "著作物(思想または感情を創作物に表現したもの)や、著作者の権利を保護する法律です。著作物には文芸，学術，音楽，美術のほかにプログラムやデータベースも含まれます。件を満たせば政府刊行物の転載が可能であることを取り決めています。その条件を要約すると、国、もしくは地方公共団体の機関、独立行政法人または地方独立行政法人が作成したもの。一般に周知させることを目的として作成されたもの。説明の材料として使う場合。禁転載との記載がないこと。「禁転載」に関しては文章中に記述がありませんが、政府が発行している白書の類には禁転載の記載がありません。",
    "ア": "ある自社製品のパンフレットで使用しているスポーツ選手の写真を，撮影者に無断で，ほかの自社製品のパンフレットに使用する。",
    "イ": "経済白書の記載内容を説明の材料として，出所を明示してWebページに転載する。",
    "ウ": "新聞の写真をスキャナで取り込んで，提案書に記載する。",
    "エ": "ユーザ団体の研究会のように限られた対象者に対し，雑誌の記事をコピーして配布する。"
  },
  {
    "問題ID": 13,
    "問題文": "サイトアクセス者の総人数に対して，最終成果である商品やサービスの購入に至る人数の割合を高める目的でショッピングサイトの画面デザインを見直すことにした。効果を測るために，見直し前後で比較すべき，効果を直接示す値はどれか。",
    "解答": "コンバージョン率",
    "解説": "コンバージョン率は、サイトアクセス者のうち、どの程度が成約（商品購入や申込み）に至ったかを示す指標です。正に設問の「サイトアクセス者の総人数に対して，最終成果である商品やサービスの購入に至る人数の割合」を表す指標ですから、効果測定のために見直し前後で比較する指標として適切です。",
    "ア": "ROAS(Return On Advertising Spend)",
    "イ": "コンバージョン率",
    "ウ": "バナー広告のクリック率",
    "エ": "ページビュー"
  },
  {
    "問題ID": 14,
    "問題文": "競争上のポジションで，フォロワの基本戦略はどれか。",
    "解答": "市場チャンスに素早く対応する模倣戦略",
    "解説": "フォロワ企業は、リーダ企業からの報復を招かないことに注意をして、収益性を高めていく必要があります。例としては、リーダー企業にとってあまり美味しくない市場(例えば、中低価格志向の市場)にターゲットを絞り、合理化・低価格化を進める戦略がよく見られます。",
    "ア": "シェア追撃などのリーダ攻撃に必要な差別化戦略",
    "イ": "市場チャンスに素早く対応する模倣戦略",
    "ウ": "製品，市場の専門特化を図る特定化戦略",
    "エ": "全市場をカバーし，最大シェアを確保する全方位戦略"
  },
  {
    "問題ID": 15,
    "問題文": "プロジェクト組織を説明したものはどれか。",
    "解答": "ある問題を解決するために一定の期間に限って結成され，問題解決とともに解散する。",
    "解説": "特定の仕事を遂行するために異なる知識やスキルを持った人たちが集まって結成される組織形態で、プロジェクトごとにプロジェクトマネージャーが任命されます。 一般的に、目標を達成したら解散になることが多い形態です。",
    "ア": "ある問題を解決するために一定の期間に限って結成され，問題解決とともに解散する。",
    "イ": "業務を機能別に分け，各機能について部下に命令，指導を行う。",
    "ウ": "製品，地域などで構成された組織単位に，利益責任をもたせる。",
    "エ": "戦略的提携や共同開発など外部の経営資源を積極的に活用するために，企業間にまたがる組織を構成する。"
  },
  {
    "問題ID": 16,
    "問題文": "情報化投資において，リスクや投資価値の類似性でカテゴリ分けし，最適な資源配分を行う際に用いる手法はどれか。",
    "解答": "ITポートフォリオ",
    "解説": "IT投資をその目的やリスクの特性ごとにカテゴライズし、そのカテゴリごとに投資割合を管理することで、限りある経営資源を有効に配分することが可能になります。経済産業省が提唱するモデルでは「戦略目標達成型」「業務効率化型」「インフラ構築型」の3つのカテゴリに分類した後、いくつかの評価項目を用いて優先順位を決定します。",
    "ア": "3C分析",
    "イ": "ITポートフォリオ",
    "ウ": "エンタープライズアーキテクチャ",
    "エ": "ベンチマーキング"
  },
  {
    "問題ID": 17,
    "問題文": "システム管理基準\" によれば，情報化投資計画を策定する段階はどれか。",
    "解答": "情報戦略",
    "解説": "組織体が主体的に経営戦略に沿って効果的な情報システム戦略を立案し、その戦略に基づき情報システムの企画・開発・運用・保守というライフサイクルの中で、効果的な情報システム投資のための、またリスクを低減するためのコントロールを適切に整備・運用するための実践規範となるものです。",
    "ア": "運用業務",
    "イ": "開発業務",
    "ウ": "企画業務",
    "エ": "情報戦略"
  },
  {
    "問題ID": 18,
    "問題文": "A社で雇用しているオペレータのQ氏を，B社に派遣することになった。労働者派遣法で定められているものはどれか",
    "解答": "Q氏は，B社の定められた指揮命令者の下で労働に従事する。",
    "解説": "雇用関係はA社とオペレータQ氏にありますが、指揮命令関係はB社とオペレータQ氏の間にあります。このように請負企業の社員が契約先の指揮命令で働くことができるようにした契約を「労働者派遣契約」といいます。",
    "ア": "A社は，Q氏がA社を辞めてB社に雇用されることを禁止できる。",
    "イ": "B社は A社に対して，Q氏を指名して派遣を要請できる。",
    "ウ": "Q氏の派遣契約期間は，最長1年間である。",
    "エ": "Q氏は，B社の定められた指揮命令者の下で労働に従事する。"
  },
  {
    "問題ID": 19,
    "問題文": "著作権法によるプログラムの保護に関する記述のうち，適切なものはどれか。",
    "解答": "他人の著作物であるプログラムを購入し，自社のパソコンでより効果的に利用するために改変を加えることができる。",
    "解説": "著作物の改変は著作物の同一性保護権を侵害することになりますが、購入したプログラムを自社の環境に適用させるためや、より効果的に利用するために必要な改変は認められています（著作権法20条2項3号）。",
    "ア": "他人の著作物であるプログラムを購入し，自社のパソコンでより効果的に利用するために改変を加えることができる。",
    "イ": "特に許可されていない場合，バックアップが目的であっても，購入したプログラムを複製すると著作権法違反となる。",
    "ウ": "プログラムの著作権を侵害して作成された複製物を使用する場合，複製物を取得したときに侵害の事実を知らなくても，使用時点で知っていれば，著作権法違反となる。",
    "エ": "プログラムは，そのアルゴリズムも含め，著作権法によって著作物として保護される。"
  },
  {
    "問題ID": 20,
    "問題文": "ディジタルサイネージの説明として，適切なものはどれか。",
    "解答": "ディスプレイに映像，文字などの情報を表示する電子看板",
    "解説": "広告入替えの手間が掛からず、表示内容がリアルタイムで操作可能であったり、動画を表示することができるなど従来のポスターやロールスクリーン看板にはないメリットがあります。店内で商品紹介をするための小型のものから、屋外広告を表示するための大型ビジョンまで様々な規模や用途で使用されています。",
    "ア": "情報技術を利用する機会又は能力によって，地域間又は個人間に生じる経済的又は社会的な格差",
    "イ": "情報の正当性を保証するために使用される電子的な署名",
    "ウ": "ディスプレイに映像，文字などの情報を表示する電子看板",
    "エ": "不正利用を防止するためにデータに識別情報を埋め込む技術"
  }
]