[
  {
    "問題ID": 1,
    "問題文": "次の流れ図は，2数 A，B の最大公約数を求めるユークリッドの互除法を，引き算の繰返しによって計算するものである。Aが876，Bが204のとき，何回の比較で処理は終了するか。",
    "解答": 11,
    "解説": "(開始時にL←876，S←204で初期化)\n876＞204 … L←876－204＝672\n672＞204 … L←672－204＝468\n468＞204 … L←468－204＝264\n264＞204 … L←264－204＝60\n60＜204 … S←204－60＝144\n60＜144 … S←144－60＝84\n60＜84 … S←84－60＝24\n60＞24 … L←60－24＝36\n36＞24 … L←36－24＝12\n12＜24 … S←24－12＝12\n12＝12 … A，B，Lの出力",
    "ア": 4,
    "イ": 9,
    "ウ": 10,
    "エ": 11
  },
  {
    "問題ID": 2,
    "問題文": "仮想記憶方式でページフォールトが発生したとき，主記憶に最も古くから存在するページを追い出すアルゴリズムはどれか。",
    "解答": "FIFO",
    "解説": "FIFOは、置き換え対象の中に最も古くから存在するページを追い出す\"先入れ先出し\"のアルゴリズムです。",
    "ア": "FIFO",
    "イ": "LFU",
    "ウ": "LIFO",
    "エ": "LRU"
  },
  {
    "問題ID": 3,
    "問題文": "ディレクトリトラバーサル攻撃に該当するものはどれか。",
    "解答": "攻撃者が，パス名を使ってファイルを指定し，管理者の意図していないファイルを不正に閲覧する。",
    "解説": "ディレクトリ＝コンピュータの磁気記憶媒体（ハード ディスク・フロッピー ディスクなど）に記録された、その媒体上のすべてのファイルの管理情報（名前・大きさ・記録場所など）。トラバーサル＝系統や構造を乗り越えてアクセスすることなどを形容する際に用いられる表現。",
    "ア": "攻撃者が，Webアプリケーションの入力データとしてデータベースへの命令文を構成するデータを入力し，管理者の意図していないSQL文を実行させる。",
    "イ": "攻撃者が，パス名を使ってファイルを指定し，管理者の意図していないファイルを不正に閲覧する。",
    "ウ": "攻撃者が，利用者をWebサイトに誘導した上で，WebアプリケーションによるHTML出力のエスケープ処理の欠陥を悪用し，利用者のWebブラウザで悪意のあるスクリプトを実行させる。",
    "エ": "セッションIDによってセッションが管理されるとき，攻撃者がログイン中の利用者のセッションIDを不正に取得し，その利用者になりすましてサーバにアクセスする。"
  },
  {
    "問題ID": 4,
    "問題文": "プラズマディスプレイの説明として，適切なものはどれか。",
    "解答": "ガス放電によって発生する光を利用して映像を表示する。",
    "解説": "プラズマディスプレイは、透明な電極を平行にならべ2枚のガラス板の薄い隙間に希ガスを封入し、この電極間に電圧をかけることによって発生する紫外線によって赤・青・緑の蛍光体を光らせて表示を行うディスプレイ",
    "ア": "ガス放電によって発生する光を利用して映像を表示する。",
    "イ": "自身では発光しないので，バックライトを使って映像を表示する。",
    "ウ": "電極の間に有機化合物を挟んだ構造で，これに電気を通すと発光することを利用して，映像を表示する。",
    "エ": "電子銃から電子ビームを発射し，管面の蛍光体に当てて発光させ，文字や映像を表示する。"
  },
  {
    "問題ID": 5,
    "問題文": "8ビットのレジスタがある。このレジスタの各ビットの値を d0，d1，…，d7とし，パリティビットの値をpとする。奇数パリティの場合，常に成立する関係式はどれか。ここで，⊕は排他的論理和演算を表す。",
    "解答": "d0⊕d1⊕ … ⊕d7⊕p＝1",
    "解説": "XOR演算には次のように演算対象の各ビットのなかの「1」の数が奇数個であれば結果は1、偶数個であれば結果が0になるという特徴があります。奇数パリティは、データを構成するビット全体の中でビット「1」の数が奇数個になるようにパリティビットを付加する方式なので、パリティビットを含めた各ビットをすべてXOR演算した結果は必ず「1」となります。",
    "ア": "0⊕d0⊕d1⊕ … ⊕d7＝p",
    "イ": "d0⊕d1⊕ … ⊕d7＝p",
    "ウ": "d0⊕d1⊕ … ⊕d7⊕p＝0",
    "エ": "d0⊕d1⊕ … ⊕d7⊕p＝1"
  },
  {
    "問題ID": 6,
    "問題文": "16進小数0.Cを10進小数に変換したものはどれか。",
    "解答": 0.12,
    "解説": "16進数を10進数に変換する場合は、16進数→2進数→10進数というように、2進数を経由して考えるとわかりやすいです。",
    "ア": 0.12,
    "イ": 0.55,
    "ウ": 0.75,
    "エ": 0.84
  },
  {
    "問題ID": 7,
    "問題文": "IDSの機能はどれか。",
    "解答": "サーバやネットワークを監視し，\n侵入や侵害を検知した場合に管理者へ通知する。",
    "解説": "IDS(Intrusion Detection System，侵入検知システム)は、ネットワークやホストをリアルタイムで監視し、異常を検知した場合に管理者に通知するなどの処置を行うシステムです。異常を通知することを目的としたシステムのため通信の遮断などの防御機能を持たないことがほとんどです。",
    "ア": "PCにインストールされているソフトウェア製品が最新のバージョンであるかどうかを確認する。",
    "イ": "検査対象の製品にテストデータを送り，製品の応答や挙動から脆(ぜい)弱性を検出する。",
    "ウ": "サーバやネットワークを監視し，侵入や侵害を検知した場合に管理者へ通知する。",
    "エ": "情報システムの運用管理状況などの情報セキュリティ対策状況と企業情報を入力し，組織の情報セキュリティへの取組み状況を自己診断する。"
  },
  {
    "問題ID": 8,
    "問題文": "データベースの障害回復に関する記述のうち，適切なものはどれか。",
    "解答": "ロールバックとは，OLTPなどの実行中に障害が発生したとき，トランザクション開始直前の状態にデータベースを復旧する処理をいう。",
    "解説": "ロールバックは、トランザクションの途中、プログラムのバグなどでアプリケーションが強制終了した場合に、更新前ログを用いてデータベースをトランザクション開始直前の状態に戻す処理です。",
    "ア": "データベースの信頼性を高めるために，同一のコピーをもつよりは，常に一世代前の内容を保持することがシステムダウン対策として効果的である。",
    "イ": "ログファイルやジャーナルファイルには，データベース更新以前の情報よりも，むしろ記録の意味で更新後の情報を格納する。",
    "ウ": "ロールバックとは，OLTPなどの実行中に障害が発生したとき，トランザクション開始直前の状態にデータベースを復旧する処理をいう。",
    "エ": "ロールフォワードでは，定期的に取得したデータベースのダンプを書き戻すことでデータベースを復旧するので，障害発生時に更新データの一部が反映されないものの，高速な復旧が期待できる。"
  },
  {
    "問題ID": 9,
    "問題文": "基数変換に関する記述のうち，適切なものはどれか。",
    "解答": "2進数の有限小数は，10進数にしても必ず有限小数になる。",
    "解説": "2進数0.1を10進数で表現すると0.5です。同様に0.01(2)→0.25(10)，0.001(2)→0.125(10)というように必ず有限の10進数に変換できます。",
    "ア": "2進数の有限小数は，10進数にしても必ず有限小数になる。",
    "イ": "8進数の有限小数は，2進数にすると有限小数にならないこともある。",
    "ウ": "8進数の有限小数は，10進数にすると有限小数にならないこともある。",
    "エ": ""
  },
  {
    "問題ID": 10,
    "問題文": "更新不可能なビューはどれか。",
    "解答": "更新不可能なビューはどれか。",
    "解説": "更新不可能なビューとは、実表に対して実表の行を挿入、更新または削除することができないビューで、更新可能なビューの逆です。ビューを更新可能とするためにはビュー定義に次に挙げる構造を含めてはいけません。集約関数（AVG、COUNT、SUM、MIN、MAXなど）2つ以上の表の結合（更新可能な結合，和集合及び列を除く）GROUP BY、ORDER BY、MODEL、CONNECT BY、START WITH、DISTINCTの各句SELECT構文のリストにコレクション式SELECT構文のリストにある副問合せWITH READ ONLYが指定された副問合せ",
    "ア": "ビュー定義にGROUP BY句が含まれるビュー",
    "イ": "ビュー定義にWHERE句が含まれるビュー",
    "ウ": "ビューに対するビュー",
    "エ": "元の表の主キーを含まないビュー"
  },
  {
    "問題ID": 11,
    "問題文": "ストアドプロシージャの利点はどれか。",
    "解答": "アプリケーションプログラムからネットワークを介してDBMSにアクセスする場合，両者間の通信量を減少させる。",
    "解説": "ストアドプロシージャ(stored procedure)は、データベースに対する一連の処理をまとめた手続きにして、データベース管理システムに保存したものです。利用者は通常のクエリを発行する代わりに、データベース管理システム内の手続きを呼び出すことによって目的の処理を実行させることができます。",
    "ア": "アプリケーションプログラムからネットワークを介してDBMSにアクセスする場合，両者間の通信量を減少させる。",
    "イ": "アプリケーションプログラムからの一連の要求を一括して処理することによって，DBMS内の実行計画の数を減少させる。",
    "ウ": "アプリケーションプログラムからの一連の要求を一括して処理することによって，DBMS内の必要バッファ数を減少させる。",
    "エ": "データが格納されているディスク装置へのI/O回数を減少させる。"
  },
  {
    "問題ID": 12,
    "問題文": "配列と比較した場合の連結リストの特徴に関する記述として，適切なものはどれか。",
    "解答": "要素を挿入する場合，数個のポインタを書き換えるだけなので，処理時間は短い。",
    "解説": "配列との比較ですが、配列ではポインタをたどっていく必要がないためデータの更新や参照は高速です。しかし配列への要素の挿入・削除の際には、位置が変化することになる対象要素すべてを移動しなければなりませんので、数個の要素のポインタを付け替えるだけでできる連結リストのほうが高速に処理できます。",
    "ア": "要素を更新する場合，ポインタを順番にたどるだけなので，処理時間は短い。",
    "イ": "要素を削除する場合，削除した要素から後ろにあるすべての要素を前に移動するので，処理時間は長い。",
    "ウ": "要素を参照する場合，ランダムにアクセスできるので，処理時間は短い。",
    "エ": "要素を挿入する場合，数個のポインタを書き換えるだけなので，処理時間は短い。"
  },
  {
    "問題ID": 13,
    "問題文": "SDメモリカードの上位規格の一つであるSDXCの特徴として，適切なものはどれか。",
    "解答": "ファイルシステムにexFATを採用し，最大2Tバイトの容量に対応できる。",
    "解説": "SDXC(SD eXtended Capacity)は、2009年に策定された規格で、ファイルシステムにexFATを採用することで記憶容量の上限を2Tバイトまで引き上げたものです。また標準サイズのほかにMicroSDXCという小さいタイプもあります。",
    "ア": "GPS，カメラ，無線LANアダプタなどの周辺機能をハードウェアとしてカードに搭載している。",
    "イ": "SDメモリカードの4分の1以下の小型サイズで，最大32Gバイトの容量をもつ。",
    "ウ": "著作権保護技術としてAACSを採用し，従来のSDメモリカードよりもセキュリティが強化された。",
    "エ": "ファイルシステムにexFATを採用し，最大2Tバイトの容量に対応できる。"
  },
  {
    "問題ID": 14,
    "問題文": "アジャイル開発で\"イテレーション\"を行う目的のうち，適切なものはどれか。",
    "解答": "ソフトウェアに存在する顧客の要求との不一致を短いサイクルで解消したり，要求の変化に柔軟に対応したりする。",
    "解説": "ソフトウェアに存在する顧客の要求との不一致を短いサイクルで解消したり，要求の変化に柔軟に対応したりする。",
    "ア": "ソフトウェアに存在する顧客の要求との不一致を短いサイクルで解消したり，要求の変化に柔軟に対応したりする。",
    "イ": "タスクの実施状況を可視化して，いつでも確認できるようにする。",
    "ウ": "ペアプログラミングのドライバとナビゲータを固定化させない。",
    "エ": "毎日決めた時刻にチームメンバが集まって開発の状況を共有し，問題が拡大したり，状況が悪化したりするのを避ける。"
  },
  {
    "問題ID": 15,
    "問題文": "AES-256で暗号化されていることが分かっている暗号文が与えられているとき，ブルートフォース攻撃で鍵と解読した平文を得るまでに必要な試行回数の最大値はどれか。",
    "解答": "2²⁵⁶",
    "解説": "鍵長256ビットということは、正しく平文に戻せる鍵は2256種類の中でいずれか1つということです。最初から順番に試していき、最後の1回（2²⁵⁶回目）で一致した場合が最大の試行回数となるので、正しい平文を得るまでに必要な試行回数の最大値は2256回となります。なお、平均試行回数は「(2²⁵⁶＋1)／2≒2²⁵⁵回」になります。",
    "ア": 256,
    "イ": "2¹²⁸",
    "ウ": "2²⁵⁵",
    "エ": "2²⁵⁶"
  },
  {
    "問題ID": 16,
    "問題文": "ロックの粒度に関する説明のうち，適切なものはどれか。",
    "解答": "データを更新するときに，粒度を大きくすると，他のトランザクションの待ちが多くなり，全体のスループットが低下する。",
    "解説": "粒度が大きいということはロックをかける範囲が広いということです。粒度が大きいと、その分だけ他のトランザクションのロック解除待ちが多くなるためスループットは低下します。",
    "ア": "データを更新するときに，粒度を大きくすると，他のトランザクションの待ちが多くなり，全体のスループットが低下する。",
    "イ": "同一のデータを更新するトランザクション数が多いときに，粒度を大きくすると，同時実行できるトランザクション数が増える。",
    "ウ": "表の全データを参照するときに，粒度を大きくすると，他のトランザクションのデータ参照を妨げないようにできる。",
    "エ": "粒度を大きくすると，含まれるデータ数が多くなるので，一つのトランザクションでかけるロックの個数が多くなる。"
  },
  {
    "問題ID": 17,
    "問題文": "通信回線を使用したデータ伝送システムにM/M/1の待ち行列モデルを適用すると，平均回線待ち時間，平均伝送時間，回線利用率の関係は，次の式で表すことができる。平均回線待ち時間＝平均伝送時間×回線利用率/1－回線利用率回線利用率が0から徐々に増加していく場合，平均回線待ち時間が平均伝送時間よりも最初に長くなるのは，回線利用率が幾つを超えたときか。",
    "解答": 0.5,
    "解説": "平均回線待ち時間が平均伝送時間より長くなるには、回線利用率/1－回線利用率が1より大きくなることが条件です。回線利用率/1－回線利用率に回線利用率を当てはめていくと、回線利用率が50％(0.5)のときにちょうど1になり、50%よりも大きくなると1を超えて、平均回線待ち時間が平均伝送時間より長くなることがわかります",
    "ア": 0.4,
    "イ": 0.5,
    "ウ": 0.6,
    "エ": 0.7
  },
  {
    "問題ID": 18,
    "問題文": "データベースの更新前や更新後の値を書き出して，データベースの更新記録として保存するファイルはどれか。",
    "解答": "ログファイル",
    "解説": "トランザクション開始前とコミット後の状態を保存したファイルで、ロールバックやロールフォワードによって障害から復旧するときに用いられます。ジャーナルファイルとも呼ばれます。ログファイルによってデータべ―スの永続性が保たれています。",
    "ア": "ダンプファイル",
    "イ": "チェックポイントファイル",
    "ウ": "バックアップファイル",
    "エ": "ログファイル"
  },
  {
    "問題ID": 19,
    "問題文": "外部割込みが発生するものはどれか。",
    "解答": "入出力動作の終了",
    "解説": "内部割込み：実行中のプログラムが原因で起こる割込み...プログラム割込み、SVC割込み、ページフォールト\n外部割込み：内部割込み以外の原因で起こる割込み...タイマ割込み、コンソール割込み、入出力割込み、機械チェック割込み",
    "ア": "仮想記憶管理での、主記憶に存在しないページへのアクセス",
    "イ": "システムコール命令の実行",
    "ウ": "ゼロによる除算",
    "エ": "入出力動作の終了"
  },
  {
    "問題ID": 20,
    "問題文": "フィードバック制御の説明として，適切なものはどれか。",
    "解答": "出力結果の目標値と比較して、一致するように制御を行う。",
    "解説": "制御対象の現在の状態を定期的に測定し、その測定値を目標値に近づけるように動作する自動制御方式です。室内の温度を一定に保つなどの自動制御システムで多く用いられています。フィードバック制御では、外乱を検知せず、その修正動作は目標値と測定値に影響が表れてからになります。",
    "ア": "あらかじめ定められた順序で制御を行う。",
    "イ": "外乱の影響が出力に現れる前に制御を行う。",
    "ウ": "出力結果と目標値とを比較して、一致するように制御を行う。",
    "エ": "出力結果を使用せず制御を行う。"
  },
  {
    "問題ID": 21,
    "問題文": "エッジコンピューティングの説明として，最も適切なものはどれか。",
    "解答": "利用者や機器に取り付けられたセンサなどのデータ発生源に近い場所にあるサーバなどでデータを一次処理し，処理のリアルタイム性を高めること",
    "解説": "処理装置をクラウド上に配置する従来の方式よりも端末と処理装置の距離が短縮されるので、アプリケーション処理の低遅延化やネットワーク負荷の低減が期待でき、高いリアルタイム性が要求されるIoTに適した技術として注目されています。",
    "ア": "画面生成やデータ処理をクライアント側で実行することによって，Webアプリケーションソフトウェアの操作性や表現力を高めること",
    "イ": "データが送信されてきたときだけ必要なサーバを立ち上げて，処理が終わり次第サーバを停止してリソースを解放すること",
    "ウ": "複数のサーバやPCを仮想化して統合することによって一つの高性能なコンピュータを作り上げ，並列処理によって処理能力を高めること",
    "エ": "利用者や機器に取り付けられたセンサなどのデータ発生源に近い場所にあるサーバなどでデータを一次処理し，処理のリアルタイム性を高めること"
  },
  {
    "問題ID": 22,
    "問題文": "3 次元グラフィックス処理におけるクリッピングの説明はどれか",
    "解答": "画像表示領域にウィンドウを定義し，ウィンドウの外側を除去し，内側の見える部分だけを取り出す処理である。",
    "解説": "最終的な仕上りに影響を与えない余分なデータを省くことで、後工程で必要となる計算量を減らし、作業効率を高めるために行われます。",
    "ア": "CG映像作成における最終段階として，物体のデータをディスプレイに描画できるように映像化する処理である。",
    "イ": "画像表示領域にウィンドウを定義し，ウィンドウの外側を除去し，内側の見える部分だけを取り出す処理である。",
    "ウ": "スクリーンの画素数が有限であるために図形の境界近くに生じる，階段状のギザギザを目立たなくする処理である。",
    "エ": "立体感を生じさせるために，物体の表面に陰影を付ける処理である。"
  },
  {
    "問題ID": 23,
    "問題文": "トランザクションが，データベースに対する更新処理を完全に行うか，全く処理し なかったかのように取り消すか，のどちらかの結果になることを保証する特性はどれか。",
    "解答": "原子性(atomicity)",
    "解説": "トランザクションが分割できない単位であることを示す特性を原子性といいます。DBMSでは、①コミットで全ての処理を確定する、②ロールバックで処理を全て巻き戻す、のいずれかの状態でトランザクションが終了するように制御しており、これにより原子性が確保されています。",
    "ア": "一貫性(consistency)",
    "イ": "原子性(atomicity)",
    "ウ": "耐久性(durability)",
    "エ": "独立性(isolation)"
  },
  {
    "問題ID": 24,
    "問題文": "ドライブバイダウンロード攻撃に該当するものはどれか。",
    "解答": "利用者が悪意のあるWebサイトにアクセスしたときに，Webブラウザの脆弱性を悪用して利用者のPCをマルウェアに感染させる。",
    "解説": "脆弱性のある利用環境だと、Webページを閲覧しただけでマルウェアの被害に遭うおそれがあります。ドライブバイダウンロードは、単独で攻撃に使用されることもありますし、また標的型攻撃や水飲み場攻撃などで補助的に使用されることもあります。",
    "ア": "PCから物理的にハードディスクドライブを盗み出し，その中のデータをWebサイトで公開し，ダウンロードさせる。",
    "イ": "電子メールの添付ファイルを開かせて，マルウェアに感染したPCのハードディスクドライブ内のファイルを暗号化し，元に戻すための鍵を攻撃者のサーバからダウンロードさせることと引換えに金銭を要求する。",
    "ウ": "利用者が悪意のあるWebサイトにアクセスしたときに，Webブラウザの脆弱性を悪用して利用者のPCをマルウェアに感染させる。",
    "エ": "利用者に気付かれないように無償配布のソフトウェアに不正プログラムを混在させておき，利用者の操作によってPCにダウンロードさせ，インストールさせることでハードディスクドライブから個人情報を収集して攻撃者のサーバに送信する。"
  },
  {
    "問題ID": 25,
    "問題文": "方程式f(x)=0の解の近似値を求めるアルゴリズムとして知られているニュートン方に関する記述として、適切なものはどれか。",
    "解答": "y=f(x)の接線を利用して解の近似値を求めるものである。",
    "解説": "ニュートン法は、非線形関数の解を求めるために使用されている方法です。接線の方程式を反復的に求める事によってf(x)=0となるxの値の近似値を得ます。",
    "ア": "y=f(x)の接線を利用して解の近似値を求めるものである。",
    "イ": "関数f(x)が解の付近で微分不可能であっても、解の近似値を求めることができる。",
    "ウ": "異なる初期値を二つ与える必要がある。",
    "エ": "どのような初期値を与えても、必ず解の近似値が得られる。"
  },
  {
    "問題ID": 26,
    "問題文": "ファジングに該当するものはどれか。",
    "解答": "ソフトウェアに，問題を引き起こしそうな多様なデータを入力し，挙動を監視して，脆弱性を見つけ出す。",
    "解説": "ファジングは、ファズデータの生成、検査対象への送信、挙動の監視を自動で行うファジングツールと呼ばれるソフトウェアを使用して行います。",
    "ア": "サーバにFINパケットを送信し，サーバからの応答を観測して，稼働しているサービスを見つけ出す。",
    "イ": "サーバのOSやアプリケーションソフトが生成したログやコマンド履歴などを解析して，ファイルサーバに保存されているファイルの改ざんを検知する。",
    "ウ": "ソフトウェアに，問題を引き起こしそうな多様なデータを入力し，挙動を監視して，脆弱性を見つけ出す。",
    "エ": "ネットワーク上を流れるパケットを収集し，そのプロトコルヘッダやデータを解析して，あらかじめ登録された攻撃パターンと一致した場合は不正アクセスと判断する。"
  },
  {
    "問題ID": 27,
    "問題文": "DRAM の特徴はどれか。",
    "解答": "メモリセル構造が単純なので高集積化することができ，ビット単価を安くできる。",
    "解説": "。集積度を上げることが比較的簡単にできるためコンピュータの主記憶装置として使用されています。",
    "ア": "書込み及び消去を一括又はブロック単位で行う。",
    "イ": "データを保持するためのリフレッシュ操作又はアクセス操作が不要である。",
    "ウ": "電源が遮断された状態でも，記憶した情報を保持することができる。",
    "エ": "メモリセル構造が単純なので高集積化することができ，ビット単価を安くできる。"
  },
  {
    "問題ID": 28,
    "問題文": "人間には読み取ることが可能でも，プログラムでは読み取ることが難しいという差異を利用して，ゆがめたり一部を隠したりした画像から文字を判読させ入力させることで，人間以外による自動入力を排除する技術はどれか。",
    "解答": "CAPTCHA",
    "解説": "CAPTCHA(キャプチャ)は、チャレンジレスポンス型テストの一種で、認証の際に異なる歪んだ文字や\n数字を表示し、書かれている文字を入力させる仕組みです。",
    "ア": "CAPTCHA",
    "イ": "QRコード",
    "ウ": "短縮URL",
    "エ": "トラックバックping"
  },
  {
    "問題ID": 29,
    "問題文": "メッセージ認証符号におけるメッセージダイジェストの利用目的はどれか。",
    "解答": "メッセージが改ざんされていないことを確認する。",
    "解説": "メッセージ認証符号(Message Authentication Code：MAC)は、通信データが改ざんされていないかを受信側で検査するために、通信データから生成する固定長のコード(メッセージダイジェスト)です。",
    "ア": "メッセージが改ざんされていないことを確認する。",
    "イ": "メッセージの暗号化方式を確認する。",
    "ウ": "メッセージの概要を確認する。",
    "エ": "メッセージの秘匿性を確保する。"
  },
  {
    "問題ID": 30,
    "問題文": "ICカードとPINを用いた利用者認証における適切な運用はどれか。",
    "解答": "PINは，ICカードには同封せず，別経路で利用者に知らせる。",
    "解説": "PINは「Personal Identification Number」の略で、クレジットカードやキャッシュカードなどのICカードの利用時に入力を求められる暗証番号のことです。利用時にはカードを所有していることと、PINを知っていることの2つで「二要素認証」を行うことでカードの不正利用を防止する仕組みになっています。PINが他人に知られるとなりすまし被害に遭うおそれがあるため、推測が困難な文字列を設定するとともに秘密にして管理する必要があります。",
    "ア": "ICカードによって個々の利用者を識別できるので，管理負荷を軽減するために全利用者に共通のPINを設定する。",
    "イ": "ICカード紛失時には，新たなICカードを発行し，PINを再設定した後で，紛失したICカードの失効処理を行う。",
    "ウ": "PINには，ICカードの表面に刻印してある数字情報を組み合わせたものを設定する。",
    "エ": "PINは，ICカードには同封せず，別経路で利用者に知らせる。"
  },
  {
    "問題ID": 31,
    "問題文": "情報の\"完全性\"を脅かす攻撃はどれか。",
    "解答": "Webページの改ざん",
    "解説": "完全性（Integrity）は、情報セキュリティマネジメントで管理すべき要素の一つで、「情報の正確さ完全さ」を示す特性です。具体的には、情報に矛盾がなく完備され、最新であり、改ざん、破壊されていない状態で維持されている度合いをいいます。機密性（Confidentiality）許可されていないユーザやシステムに対して情報を使用させず、開示しない特性。許可された正規のユーザだけが情報にアクセスできる度合いを示す可用性（Availability）ユーザが要求したときにシステムが利用可能である特性。障害がなくシステムが正常に稼働し続けることの度合いを示す",
    "ア": "Webページの改ざん",
    "イ": "システム内に保管されているデータの不正コピー",
    "ウ": "システムを過負荷状態にするDoS攻撃",
    "エ": "通信内容の盗聴"
  },
  {
    "問題ID": 32,
    "問題文": "オブジェクト指向言語のクラスに関する記述のうち，適切なものはどれか。",
    "解答": "オブジェクトに共通する性質を定義したものがクラスであり，クラスを集めたものがクラスライブラリである。",
    "解説": "クラスライブラリは、関連する機能を提供する複数のクラスを集めてひとまとまりにしたものです。",
    "ア": "インスタンス変数には共有データが保存されているので，クラス全体で使用できる。",
    "イ": "オブジェクトに共通する性質を定義したものがクラスであり，クラスを集めたものがクラスライブラリである",
    "ウ": "オブジェクトはクラスによって定義され，クラスにはメソッドと呼ばれる共有データが保存されている。",
    "エ": "スーパクラスはサブクラスから独立して定義し，サブクラスの性質を継承する。"
  },
  {
    "問題ID": 33,
    "問題文": "メモリリークの説明として，適切なものはどれか。",
    "解答": "OSやアプリケーションのバグなどが原因で，動作中に確保した主記憶が解放されないことであり，これが発生すると主記憶中の利用可能な部分が減少する。",
    "解説": "アプリケーションが「自身で獲得したメモリの解放忘れる」などのプログラム不備などが原因で発生します。",
    "ア": "OSやアプリケーションのバグなどが原因で，動作中に確保した主記憶が解放されないことであり，これが発生すると主記憶中の利用可能な部分が減少する。",
    "イ": "アプリケーションの同時実行数を増やした場合に，主記憶容量が不足し，処理時間のほとんどがページングに費やされ，スループットの極端な低下を招くことである。",
    "ウ": "実行時のプログラム領域の大きさに制限があるときに，必要になったモジュールを主記憶に取り込む手法である。",
    "エ": "主記憶で利用可能な空き領域の総量は足りているのに，主記憶中に不連続で散在しているので，大きなプログラムをロードする領域が確保できないことである。"
  },
  {
    "問題ID": 34,
    "問題文": "アナログ電圧をディジタル化した後に演算処理することの利点として，適切なものはどれか",
    "解答": "演算結果が部品精度，温度変化及び外来雑音の影響を受けにくい。",
    "解説": "アナログ値では外来ノイズが測定される値にダイレクトに影響しますが、ディジタル化ではある一定範囲内の値はすべて同じディジタル値に変換されることになります。少々のノイズが有っても範囲内に収まっていれば変換後の値に変化はないので、ディジタル化された値はノイズの影響を受けにくい特徴があります。",
    "ア": "アナログからディジタルへの変換では誤差が発生しない。",
    "イ": "演算結果が部品精度，温度変化及び外来雑音の影響を受けにくい。",
    "ウ": "数値演算において丸め誤差が発生することはない。",
    "エ": "電圧が変化してから演算結果を得るまでの遅延時間が発生しない。"
  },
  {
    "問題ID": 35,
    "問題文": "記憶領域の動的な割当て及び解放を繰り返すことによって，どこからも利用されない記憶領域が発生することがある。このような記憶領域を再び利用可能にする処理はどれか。",
    "解答": "ガーベジコレクション",
    "解説": "従来の（ガーベジコレクションがない）プログラム言語では、プログラマが必要なメモリを確保する命令を記述し、使用後に明示的に解放する必要がありましたが、ガーベジコレクションが採用されている処理系では、不要と判断された時点で自動的にメモリの解放が行われます。",
    "ア": "ガーベジコレクション",
    "イ": "スタック",
    "ウ": "ヒープ",
    "エ": "フラグメンテーション"
  },
  {
    "問題ID": 36,
    "問題文": "仮想記憶方式の一つに，仮想アドレス空間を固定長の領域に分割して管理するものがある。この固定長の領域を示す用語はどれか。",
    "解答": "ページ",
    "解説": "補助記憶装置から主記憶にページを移すことをページイン，逆に主記憶から補助記憶装置に移すことをページアウトといいます。",
    "ア": "セクタ",
    "イ": "セグメント",
    "ウ": "フレーム",
    "エ": "ページ"
  },
  {
    "問題ID": 37,
    "問題文": "ソフトウェアのテストの種類のうち，ソフトウェア保守のために行った変更によって，影響を受けないはずの箇所に影響を及ぼしていないかどうかを確認する目的で行うものはどれか",
    "解答": "リグレッションテスト",
    "解説": "システムに変更作業を実施した場合に、それによって以前まで正常に機能していた部分に不具合や影響が出ていないかを検証するためのテストです。",
    "ア": "運用テスト",
    "イ": "結合テスト",
    "ウ": "システムテスト",
    "エ": "リグレッションテスト"
  },
  {
    "問題ID": 38,
    "問題文": "DBMSの排他制御に関する記述のうち，適切なものはどれか。",
    "解答": "複数の人が同時に更新する可能性のあるデータには，排他制御が必要である。",
    "解説": "同時更新による更新消失を防止し、データベースの一貫性を保つためにデータを更新する際に更新対象のデータに対する他のトランザクションからのアクセスを禁止する方法です。",
    "ア": "アクセス頻度の高いデータの処理速度を上げるためには，排他制御が必要である。",
    "イ": "処理速度を上げるため，排他制御を行うデータの範囲は極力大きくすべきである。",
    "ウ": "データアクセス時のデッドロックを防止するために，排他制御が必要である。",
    "エ": "複数の人が同時に更新する可能性のあるデータには，排他制御が必要である。"
  },
  {
    "問題ID": 39,
    "問題文": "ページング方式の説明として，適切なものはどれか。",
    "解答": "仮想記憶空間と実記憶空間を，固定長の領域に区切り，対応づけて管理する方式",
    "解説": "ページング方式は、仮想記憶管理方式の一つで仮想アドレス空間を「ページ」と呼ばれる固定長の区画に分割、同時に主記憶上の区画も同じように固定長に分割して、このページ単位で主記憶と補助記憶装置のアドレス変換を行う方式です。補助記憶装置から主記憶にページを移すことを「ページイン」、逆に主記憶から補助記憶装置に移すことを「ページアウト」といいます。",
    "ア": "仮想記憶空間と実記憶空間を，固定長の領域に区切り，対応づけて管理する方式",
    "イ": "主記憶装置の異なった領域で実行できるように，プログラムを再配置する方式",
    "ウ": "主記憶装置を，同時に並行して読み書き可能な複数の領域に分ける方式",
    "エ": "補助記憶装置に，複数のレコードをまとめて読み書きする方式"
  },
  {
    "問題ID": 40,
    "問題文": "スループットに関する記述のうち，適切なものはどれか。",
    "解答": "プリンタへの出力を一時的に磁気ディスク装置へ保存するスプーリングは，スループットの向上に役立つ。",
    "解説": "処理が遅いプリンタの出力に合わせてCPUがデータ転送処理を行うと、CPUに遊休時間が生じてしまいます。そこで一度出力データを補助記憶装置へ転送し、補助記憶装置からプリンタにデータを転送することで、CPUは即座に次の処理にうつることができます。（スプーリング処理）これによってCPUの空き時間が減少し、有効に使うことができるのでスループットは向上が見込めます。",
    "ア": "ジョブとジョブの実行の間にオペレータが介入することによってシステムに遊休時間が生じても，スループットには影響を及ぼさない。",
    "イ": "スループットはCPU性能の指標であり，入出力の速度，オーバヘッド時間などによって影響を受けない。",
    "ウ": "多重プログラミングはターンアラウンドタイムの短縮に貢献するが，スループットの向上にはあまり役立たない。",
    "エ": "プリンタへの出力を一時的に磁気ディスク装置へ保存するスプーリングは，スループットの向上に役立つ。"
  },
  {
    "問題ID": 41,
    "問題文": "ネットワーク機器の一つであるスイッチングハブ(レイヤ2スイッチ)の機能として，適切なものはどれか。",
    "解答": "受信したパケットを，宛先MACアドレスが存在するLANポートだけに転送する。",
    "解説": "内部にMACアドレスとネットワーク内のノードの対応を記録したMACアドレステーブルを保持していて、これを基にデータフレームの転送を行います。スイッチングハブと同様にデータリンク層で動作する機器にブリッジがありますが、ブリッジがソフトウェアで宛先制御を行うのに対して、スイッチングハブはハードウェア機構によって宛先制御を行うためより高速に動作するという違いがあります。",
    "ア": "LANポートに接続された端末に対して，lPアドレスの動的な割当てを行う。",
    "イ": "受信したパケットを，宛先MACアドレスが存在するLANポートだけに転送する。",
    "ウ": "受信したパケットを，全てのLANポートに転送(ブロードキャスト)する。",
    "エ": "受信したパケットを，ネットワーク層で分割(フラグメンテーション)する。"
  },
  {
    "問題ID": 42,
    "問題文": "プロセッサの制御機構に分類されるものはどれか。",
    "解答": "命令デコーダ",
    "解説": "命令デコーダは、命令レジスタから受け取った命令を解読し、各装置や機構へ分配する制御信号や制御情報を生成する機構です。",
    "ア": "ALU",
    "イ": "アキュムレータ",
    "ウ": "命令デコーダ",
    "エ": "メモリアドレスレジスタ"
  },
  {
    "問題ID": 43,
    "問題文": "オブジェクト指向の特徴はどれか。",
    "解答": "継承という概念によって，モデルの拡張や変更の際に変更箇所を局所化できる。",
    "解説": "",
    "ア": "",
    "イ": "",
    "ウ": "",
    "エ": ""
  },
  {
    "問題ID": 44,
    "問題文": "",
    "解答": "",
    "解説": "",
    "ア": "",
    "イ": "",
    "ウ": "",
    "エ": ""
  },
  {
    "問題ID": 45,
    "問題文": "",
    "解答": "",
    "解説": "",
    "ア": "",
    "イ": "",
    "ウ": "",
    "エ": ""
  },
  {
    "問題ID": 46,
    "問題文": "",
    "解答": "",
    "解説": "",
    "ア": "",
    "イ": "",
    "ウ": "",
    "エ": ""
  },
  {
    "問題ID": 47,
    "問題文": "",
    "解答": "",
    "解説": "",
    "ア": "",
    "イ": "",
    "ウ": "",
    "エ": ""
  },
  {
    "問題ID": 48,
    "問題文": "",
    "解答": "",
    "解説": "",
    "ア": "",
    "イ": "",
    "ウ": "",
    "エ": ""
  },
  {
    "問題ID": 49,
    "問題文": "",
    "解答": "",
    "解説": "",
    "ア": "",
    "イ": "",
    "ウ": "",
    "エ": ""
  },
  {
    "問題ID": 50,
    "問題文": "",
    "解答": "",
    "解説": "",
    "ア": "",
    "イ": "",
    "ウ": "",
    "エ": ""
  }
]